responseTemplates/PaCo.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns4="urn:ucbru:gbo:v3" xmlns:ns3="urn:ucbru:gbo:v3:st" xmlns:ns6="urn:ucbru:gbo:v5:spdep" xmlns:SOAP-ENV0="http://mfms.ru/mfmsgate/push/devices" xmlns:ns5="urn:ucbru:gbo:v5:loan" xmlns:ns8="urn:ucbru:gbo:v5:card" xmlns:ns7="urn:ucbru:gbo:v5:acc" xmlns:ns13="urn:ucbru:gbo:v5:push:devices:response" xmlns:ns9="urn:ucbru:gbo:v5:cif" xmlns:ns12="urn:ucbru:gbo:v5:push:devices:request" xmlns:ns11="urn:ucbru:gbo:v5:ordst" xmlns:ns10="urn:ucbru:gbo:v5:docst" xmlns:ns17="urn:imb:gbo:BSCardStm" xmlns:ns16="urn:ucbru:gbo:v4" xmlns:gbo="urn:ucbru:gbo:v5" xmlns:sdpmt="urn:ucbru:gbo:v5:sdpmt" xmlns:ns19="urn:ucbru:esb:srv:sms" xmlns:ns18="urn:imb:gbo:BSCardAuthorization">
    <SOAP-ENV:Header>
        <gbo:UCBRUHeaders>
            <gbo:Audit>
                <gbo:MessagePath>
                    <gbo:Step>
                        <gbo:Application.Module>SDPMT.SDPMTPayConfirm</gbo:Application.Module>
                        <gbo:VersionId>urn:ucbru:gbo:v5</gbo:VersionId>
                        <gbo:TimeStamp>${generate.dateNow}</gbo:TimeStamp>
                        <gbo:RoutingRole>START</gbo:RoutingRole>
                        <gbo:Comment></gbo:Comment>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>SDPMT.SDPMTPayConfirm</gbo:Application.Module>
                        <gbo:VersionId>urn:ucbru:gbo:v5</gbo:VersionId>
                        <gbo:TimeStamp>${generate.dateNow}</gbo:TimeStamp>
                        <gbo:RoutingRole>SUCCESS</gbo:RoutingRole>
                        <gbo:Comment></gbo:Comment>
                    </gbo:Step>
                </gbo:MessagePath>
                <gbo:ProcessInfo>
                    <gbo:Name>androidMBPI</gbo:Name>
                    <gbo:InstanceId>${receive.id}</gbo:InstanceId>
                </gbo:ProcessInfo>
            </gbo:Audit>
        </gbo:UCBRUHeaders>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <sdpmt:SDPMTPayConfirm>
            <sdpmt:Code>SUCCESS</sdpmt:Code>
            <sdpmt:Description>Возможность проведения операции подтверждена</sdpmt:Description>
            <sdpmt:BeneficiaryPAM>Петр Петрович П</sdpmt:BeneficiaryPAM>
            <sdpmt:BusinessMessageId>${receive.businessId}</sdpmt:BusinessMessageId>
        </sdpmt:SDPMTPayConfirm>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>